/** @param state {FetoState} */
export function LoadPrimer(state) {
  // fill examples here
  const primer = [];

  primer[0] = "Призрачно все в этом мире бушующем.\nЕсть только миг - за него и держись.\nЕсть только миг между прошлым и будущим.\nИменно он называется жизнь.\n\nВечный покой сердце вряд ли обрадует.\nВечный покой для седых пирамид\nА для звезды, что сорвалась и падает\nЕсть только миг - ослепительный миг.\n\nПусть этот мир вдаль летит сквозь столетия.\nНо не всегда по дороге мне с ним.\nЧем дорожу, чем рискую на свете я -\nМигом одним - только мигом одним.\n\nСчастье дано повстречать иль беду ещё\nЕсть только миг - за него и держись.\nЕсть только миг между прошлым и будущим.\nИменно он называется жизнь.";

  primer[1] = "Буря мглою небо кроет,\nВихри снежные крутя;\nТо, как зверь, она завоет,\nТо заплачет, как дитя,\n\nТо по кровле обветшалой\nВдруг соломой зашумит,\nТо, как путник запоздалый,\nК нам в окошко застучит.\n\nНаша ветхая лачужка\nИ печальна и темна.\nЧто же ты, моя старушка,\nПриумолкла у окна?\n\nИли бури завываньем\nТы, мой друг, утомлена,\nИли дремлешь под жужжаньем\nСвоего веретена?\n\nВыпьем, добрая подружка\nБедной юности моей,\nВыпьем с горя; где же кружка?\nСердцу будет веселей.\n\nСпой мне песню, как синица\nТихо за морем жила;\nСпой мне песню, как девица\nЗа водой поутру шла.\n\nБуря мглою небо кроет,\nВихри снежные крутя;\nТо, как зверь, она завоет,\nТо заплачет, как дитя.\n\nВыпьем, добрая подружка\nБедной юности моей,\nВыпьем с горя; где же кружка?\nСердцу будет веселей.\n";

  primer[2] = "Белеет парус одинокой\nВ тумане моря голубом!\nЧто ищет он в стране далекой?\nЧто кинул он в краю родном?\n\nИграют волны - ветер свищет,\nИ мачта гнется и скрыпит.\nУвы! он счастия не ищет\nИ не от счастия бежит!\n\nПод ним струя светлей лазури,\nНад ним луч солнца золотой.\nА он, мятежный, просит бури,\nКак будто в бурях есть покой!";

  primer[3] = "Алый мрак в небесной черни\nНачертил пожаром грань.\nЯ пришел к твоей вечерне,\nПолевая глухомань.\n\nНелегка моя кошница,\nНо глаза синее дня.\nЗнаю, мать-земля чернИца,\nВсе мы тесная родня.\n\nРазошлись мы в даль и шири\nПод лазоревым крылом.\nНо сзовет нас из псалтыри\nЗаревой заре псалом.\n\nИ придем мы по равнинам\nК правде сошьего креста\nСветом книги голубиной\nНапоить свои уста.";

  primer[4] = "Я тебЕ ничегО не скажУ,\nИ тебЯ не встревОжу ничУть,\nИ о тОм, что я мОлча твержУ,\nнЕ решУсь ни за чтО намекнУть.\n\nцЕлый дЕнь спят ночнЫе цветЫ,\nнО лишь сОлнце за рОщу зайдЕт,\nраскрывАются тИхо листЫ\nИ я слЫшу, как сЕрдце цветЕт.\n\nИ в больнУю, устАлую грУдь\nвЕет влАгой ночнОй… я дрожУ,\nЯ тебЯ не встревОжу ничУть,\nЯ тебЕ ничегО не скажУ.";

  primer[5] = "Снова замерло всё до рассвета -\nДверь не скрипнет, не вспыхнет огонь.\nТолько слышно - на улице где-то\nОдинокая бродит гармонь:\n\nТо пойдет на поля, за ворота,\nТо обратно вернется опять,\nСловно ищет в потемках кого-то\nИ не может никак отыскать.\n";

  primer[6] = "В те дни, когда мне были новы\nВсе впечатленья бытия -\nИ взоры дев, и шум дубровы,\nИ ночью пенье соловья,-\n\nКогда возвышенные чувства,\nСвобода, слава и любовь\nИ вдохновенные искусства\nТак сильно волновали кровь,-\n\nЧасы надежд и наслаждений\nТоской внезапной осеня,\nТогда какой-то злобный гений\nСтал тайно навещать меня.\n\nПечальны были наши встречи:\nЕго улыбка, чудный взгляд,\nЕго язвительные речи\nВливали в душу хладный яд.\n\nНеистощимой клеветою\nОн провиденье искушал;\nОн звал прекрасное мечтою;\nОн вдохновенье презирал;\n\nНе верил он любви, свободе;\nНа жизнь насмешливо глядел -\nИ ничего во всей природе\nБлагословить он не хотел.";

  primer[7] = "Не напрасно дули ветры,\nНе напрасно шла гроза.\nКто-то тайный тихим светом\nНапоил мои глаза.\n\nС чьей-то ласковости вешней\nОтгрустил я в синей мгле\nО прекрасной, но нездешней,\nНеразгаданной земле.\n\nНе гнетет немая млечность\nНе тревожит звездный страх.\nПолюбил я мир и вечность\nКак родительский очаг.\n\nВсе в них благостно и свято,\nВсе тревожное светло.\nПлещет рдяный мак заката\nНа озерное стекло.\n\nИ невольно в море хлеба\nРвется образ с языка:\nОтелившееся небо\nЛижет красного телка.\n";

  primer[8] = "Мне голос был. Он звал утешно,\nОн говорил: «Иди сюда,\nОставь свой край глухой и грешный,\nОставь Россию навсегда.\n\nЯ кровь от рук твоих отмою,\nИз сердца выну чёрный стыд,\nЯ новым именем покрою\nБоль поражений и обид».\n\nНо равнодушно и спокойно\nРуками я замкнула слух,\nЧтоб этой речью недостойной\nНе осквернялся скорбный дух.";

  primer[9] = "Сжала руки под темной вуалью…\n'Отчего ты сегодня бледна?'\n— Оттого, что я терпкой печалью\nНапоила его допьяна.\n\nКак забуду? Он вышел, шатаясь,\nИскривился мучительно рот…\nЯ сбежала, перил не касаясь,\nЯ бежала за ним до ворот.\n\nЗадыхаясь, я крикнула: 'Шутка\nВсе, что было. Уйдешь, я умру.'\nУлыбнулся спокойно и жутко\nИ сказал мне: 'Не стой на ветру'.";

  primer[10] = "Я научилась просто, мудро жить,\nСмотреть на небо и молиться Богу,\nИ долго перед вечером бродить,\nЧтоб утомить ненужную тревогу.\n\nКогда шуршат в овраге лопухи\nИ никнет гроздь рябины желто-красной,\nСлагаю я веселые стихи\nО жизни тленной, тленной и прекрасной.\n\nЯ возвращаюсь. Лижет мне ладонь\nПушистый кот, мурлыкает умильней,\nИ яркий загорается огонь\nНа башенке озерной лесопильни.\n\nЛишь изредка прорезывает тишь\nКрик аиста, слетевшего на крышу.\nИ если в дверь мою ты постучишь,\nМне кажется, я даже не услышу.\n";

  primer[11] = "Ночь, улица, фонарь, аптека,\nБессмысленный и тусклый свет.\nЖиви еще хоть четверть века —\nВсе будет так. Исхода нет.\n\nУмрешь — начнешь опять сначала\nИ повторится все, как встарь:\nНочь, ледяная рябь канала,\nАптека, улица, фонарь.";

  primer[12] = "Никогда не забуду (он был, или не был,\nЭтот вечер): пожаром зари\nСожжено и раздвинуто бледное небо,\nИ на жёлтой заре — фонари.\n\nЯ сидел у окна в переполненном зале.\nГде-то пели смычки о любви.\nЯ послал тебе чёрную розу в бокале\nЗолотого, как нёбо, аи.\n\nТы взглянула. Я встретил смущённо и дерзко\nВзор надменный и отдал поклон.\nОбратясь к кавалеру, намеренно резко\nТы сказала: «И этот влюблён».\n\nИ сейчас же в ответ что-то грянули струны,\nИсступлённо запели смычки…\nНо была ты со мной всем презрением юным,\nЧуть заметным дрожаньем руки…\n\nТы рванулась движеньем испуганной птицы,\nТы прошла, словно сон мой легка…\nИ вздохнули духи, задремали ресницы,\nЗашептались тревожно шелка.\n\nНо из глуби зеркал ты мне взоры бросала\nИ, бросая, кричала: «Лови!..»\nА монисто бренчало, цыганка плясала\nИ визжала заре о любви.";

  primer[13] = "Я пропал, как зверь в загоне.\nГде-то люди, воля, свет,\nА за мною шум погони,\nМне наружу ходу нет.\n\nТемный лес и берег пруда,\nЕли сваленной бревно.\nПуть отрезан отовсюду.\nБудь что будет, все равно.\n\nЧто же сделал я за пакость,\nЯ убийца и злодей?\nЯ весь мир заставил плакать\nНад красой земли моей.\n\nНо и так, почти у гроба,\nВерю я, придет пора —\nСилу подлости и злобы\nОдолеет дух добра.";


  primer[14] = "Окна в решЕтках, и сУмрачны лИца,\nзлОба глядИт ненавИстно на брАта;\nЯ признаЮ твоИ стЕны, темнИца,—\nЮности пИр ликовАл здесь когдА-то.\n\nчтО ж там мелькнУло красОю нетлЕнной?\nАх, то цветОк мой весЕнний, любИмый!\nкАк уцелЕл ты, засОхший, смирЕнный,\nтУт, под ногАми толпЫ нелюдИмой?\n\nрАдость сиЯла, чистА безупрЕчно,\nв чАс, как тебЯ обронИла невЕста.\nнЕт, не покИну тебЯ бессердЕчно,\nздЕсь, у менЯ на грудИ тебЕ мЕсто.";


  primer[15] = "человЕку нАдо мАло:\nчтОб искАл И находИл.\nчтОб имЕлись длЯ начАла\nдрУг — одИн И враг — одИн…\n\nчеловЕку нАдо мАло:\nчтОб тропИнка вдАль велА.\nчтОб жилА нА свЕте мАма.\nскОлько нУжно Ей — жилА.\n\nчеловЕку нАдо мАло:\nпОсле грОма — тишинУ.\nгОлубой клочОк тумАна.\nжИзнь — однУ.И смерть — однУ.\n\nУтром свЕжую газЕту —\nс человЕчеством родствО.\nИ всегО однУ планЕту:\nзЕмлю! тОлько И всегО.\n\nИ — межзвЕздную дорОгу\nдА мечтУ О скоростЯх.\nЭто, в сУщности,- немнОго.\nЭто, в Общем-тО,- пустЯк.\n\nневелИкая нагрАда.\nневысОкий пьедестАл.\nчеловЕку мАло нАдо.\nлИшь бы дОма ктО-то ждАл.";

  primer[16] = "цЕлую нОчь сОловей нам насвИстывал, \nгОрод молчАл И молчАли домА... \nбЕлой акАции грОздья душИстые\nнОчь напролЕт нАс сводИли с умА. \n\nсАд весь умЫт бЫл весЕнними лИвнями, \nв тЕмных оврАгах стоЯла водА. \nбОже, какИми мы бЫли наИвными, \nкАк же мы мОлоды бЫли тогдА! \n\nгОды промчАлись, седЫми нас дЕлая... \nгдЕ чистотА Этих вЕток живЫх? \nтОлько зимА И метЕль Эта бЕлая\nнапоминАет сегОдня о нИх. \n\nв чАс, когдА вЕтер бушУет неИстово, \nс нОвою сИлою чУвствую Я: \nбЕлой акАции грОздья душИстые\nневозвратИмы, как Юность моЯ! ";

  primer[17] = "нА святОй русИ, нашей мАтушке,\nнЕ найтИ, не сыскАть такОй красАвицы:\nхОдит плАвно — бУдто лебЕдушка;\nсмОтрит слАдко — кАк голУбушка; \n\nМолвит слово — соловей поет;\nГорят щеки ее румяные,\nКак заря на небе божием;\nКосы русые, золотистые,\n\nВ ленты яркие заплетенные,\nПо плечам бегут, извиваются,\nС грудью белою цалуются.";


  //
  var rn = 999; // check random logic

  LentaClearFormStih(state);
  state.flagSetAccent = 0;
  state.AccentCountSimvol = 0;
  let CountPrimer = primer.length;
  if (rn === 999) {
    rn = Math.round(-0.5 + Math.random() * CountPrimer)
  }

  if (rn < CountPrimer) {
    ++rn
  }

  if (rn > CountPrimer - 1) {
    rn = 0
  }

  state.OriginalTextInput = primer[rn];
  TextStihResize();
}